#include <iostream>
#include <locale>
#include <string>

using namespace std;

int main()
{
	setlocale(LC_ALL, "Rus");
	int a, b, c, num;
	string edin[] = { "","один", "два", "три", "четыре", "пять", "шесть", "семь", "восемь", "девять" };
	string teen[] = { "десять","одиннадцать","двенадцать","тринадцать","четырнадцать","пятнадцать","шестнадцать","семнадцать","восемнадцать","девятнадцать" };
	string des[] = { "","","двадцать ","тридцать ","сорок ","пятьдесят ","шестьдесят ","семьдесят ","восемьдесят ","девяносто " };
	string sto[] = { "сто","двести","триста","четыреста","пяитьсот","шестьсот","семьсот","восемьсот","девятьсот" };
	cout << "Введите число:\n";
	cin >> num;
	a = num / 100;
	b = num % 100 / 10;
	c = num % 10;
	cout << sto[a-1]<<" ";
	if (b == 1)
	{
		cout << teen[c];
	}
	else
	{
		cout << des[b] << edin[c];
	}
}